app/controllers/snippets_controller.rb

  def index
    if params[:search]
		@snippets = Snippet.search(params[:search]).order("id DESC").page params[:page]
---
SELECT  "snippets".* FROM "snippets" WHERE (snippet LIKE '%Contrary%')  ORDER BY id DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "snippets" WHERE (snippet LIKE '%Contrary%')

  def create
    @snippet = Snippet.new(snippet_params)

    respond_to do |format|
      if @snippet.save
---
INSERT INTO "snippets" ("snippet", "is_private", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["snippet", "wegwgwegwegewg"], ["is_private", "t"], ["created_at", "2015-07-08 05:25:06.475279"], ["updated_at", "2015-07-08 05:25:06.475279"]]

  def update
    respond_to do |format|
      if @snippet.update(snippet_params)
---
UPDATE "snippets" SET "snippet" = ?, "is_private" = ?, "updated_at" = ? WHERE "snippets"."id" = ?  [["snippet", "NewSnippet"], ["is_private", "f"], ["updated_at", "2015-07-08 08:18:31.559425"], ["id", 1]]

  def destroy
    @snippet.destroy
---
DELETE FROM "snippets" WHERE "snippets"."id" = ?  [["id", 1]]

    def set_snippet
      @snippet = Snippet.find(params[:id])
---
SELECT  "snippets".* FROM "snippets" WHERE "snippets"."id" = ? LIMIT 1  [["id", 3]]